{
	"intro": {
		"name": "Mawin Srichat",
		"nickname": "Win",
		"phone": "0649815354",
		"email": "mawin.sct@gmail.com",
		"github": "WinRafaelx",
		"linkedin": "",
		"location": "Bangkok, Thailand",
		"website": "winrafaelx.github.io/"
	},
	"projects": [
		{
			"name": "ArtPiece",
			"task": "Fullstack",
			"details": "ReactJS, NodeJs, MongoDB, Hugging Face Inference API, Cloudinary",
			"description": "Web generate an image from text using stabilityai/stable-diffusion-2-1 API, store the image into Cloudinary and then I keep the image URL in MongoDB for querying to show in home page.",
			"url": "github.com/WinRafaelx/Web_GenImage",
			"hide": false
		},
		{
			"name": "GameAPI",
			"task": "Backend",
			"details": "Golang(Jwt, Gorm, Fiber), Docker, PostgreSQL, PgAdmin",
			"description": "Developed a REST API for game data management by using GORM for PostgreSQL storage. Integrated JWT token authentication to ensure exclusive access for authorized members.",
			"url": "github.com/WinRafaelx/GameAPI",
			"hide": false  
		},
		{
			"name": "AnimeBlog",
			"task": "Frontend",
			"details": "ReactJS, MaterialUI, Firebase Database, Firebase Auth, Firebase Storage",
			"description": "Web blog about anime that users can register and log in to post and comment likes on Facebook.",
			"url": "anime-post.pages.dev/",
			"hide": false
		},
		{
			"name": "CielBlog",
			"task": "Frontend",
			"details": "HTML, CSS, VanillaJS",
			"description": "Web blog from basic tools like HTML, CSS and VanillaJS.",
			"url": "blog-webapp-7sn.pages.dev/",
			"hide": false
		}
	],
	"activities": [
		{
			"name": "Runner-up in Bootcathon 2024 by ExxonMobil",
			"details": "I developed “Exxon Support,” a website for local garages featuring AI-powered customer query handling with Typhoon API, a reservation service for booking appointments, and an admin dashboard for managing schedules efficiently.",
			"hide": false
		},
		{
			"name": "1st BorntoDev Dev Init Frontend Camp",
			"details": "Camp for developing skills to get into the IT & Dev industry. I have learned from basic to advanced front-end development from creating many websites within the scope of tools that they have limited for each project in 3 months",
			"hide": false
		},
		{
			"name": "Thailand Computer Olympiad Camp (2021)",
			"details": "Camp for learning competitive programming and algorithms in C and C++. I have learned about algorithms and data structure and how to use them to solve problems in programming contests.",
			"hide": false
		}
	],
	"technologies": [
		{
			"section": "Languages:",
			"details": "C, C++, Python, JavaScript, Node.js, TypeScript, Golang, SQL, Bash"
		},
		{
			"section": "Libraries & Frameworks:",
			"details": "ReactJS, NextJS, TailwindCSS, Bootstrap, MaterialUI, Vite, Django"
		},
		{
			"section": "Tools:",
			"details": "Git, Docker, GitHub, MongoDB"
		},
		{
			"section": "Other:",
			"details": "Firebase, Vercel, CloudFlare, Hugging Face, VS Code, Google Colab"
		}
	],
	"workExperiences": [
		{
			"position": "Frontend Developer",
			"company": "NUD Channel",
			"url": "https://nudchannel.com/",
			"years": ["2021", "2022"],
			"details": [
				"Learn to use VueJS and NuxtJS to create websites.",
				"Understand web architecture, including frontend, backend, databases, and servers.",
				"Learn Git, GitLab, and Docker for better version control and development workflows.",
				"Learn to interact and collaborate with a developer team."
			]
		},
		{
			"position": "Full-Stack Developer",
			"company": "Looloo Technology",
			"url": "https://loolootech.com/",
			"years": ["June-July 2024"],
			"details": [
				"Developed real-world projects, including a full-scale ERP website and a demo AI website integrating APIs from the ML team.",
				"Collaborate with cross-functional teams including product managers, admin, designer, and QA to deliver client-focused solutions.",
				"Participate in code reviews and contribute to best practices, enhancing code quality and team knowledge sharing with mentor and fellow interns.",
				"Engage in Agile methodologies, attending daily scrum meetings and sprint planning to improve workflow efficiency."
			]
		}
	],
	"educations": [
		{
			"head": "King Mongkut's University of Technology Thonburi, Thailand",
			"details": "B.Eng. Computer Engineering, TH. 2022-Present (Expected May 2026) (GPAX 3.59)",
			"take_courses": "Basic Computer Programming, Data Structure, Algorithm"
		}
	],
	"certifications": [
		{
			"name": "825/990 TOEIC part reading & listening (2021)",
			"details": "International standardized test of English language proficiency for non-native speakers. A score range of 800 or more is considered advanced proficiency"
		}
	],
	"interests": [
		"Gaming: MOBA, Soulslike, and Strategy games",
		"Sport: Badminton",
		"Reading: History, Psychology, Philosophy, Anime & Manga"
	],
	"resumeUrl": {
		"sourceLink": "https://github.com/WinRafaelx/MyResume",
		"fullVersion": ""
	}
}
